projects/11_boat_hull_floating/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    boat_hull.stl
    {
        type triSurfaceMesh;
        name boat;
    }

    refinementBox
    {
        type searchableBox;
        min (-0.15 -0.08 -0.06);
        max ( 0.25  0.08  0.06);
    }

    waterlineBox
    {
        type searchableBox;
        min (-0.15 -0.08 -0.02);
        max ( 0.25  0.08  0.02);
    }
}

castellatedMeshControls
{
    maxLocalCells       200000;
    maxGlobalCells      2000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "boat_hull.eMesh";
            level 3;
        }
    );

    refinementSurfaces
    {
        boat
        {
            level (2 3);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1 1));
        }
        waterlineBox
        {
            mode inside;
            levels ((2 2));
        }
    }

    locationInMesh (0.3 0 0.05);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        boat
        {
            nSurfaceLayers  2;
        }
    }
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        0.001;
    nGrow               0;
    featureAngle        60;
    nRelaxIter          5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.02;
    minVolRatio         0.01;
    minTriangleTwist    -1;

    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

debug 0;

mergeTolerance 1e-06;

// ************************************************************************* //
